tutorials/cfdemSolverMultiphase/particlesWaterEntry/CFD/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    walls
    {
        type            zeroGradient; //fixedFluxPressure;
        //value           uniform 0;
    }

/*    outlet
    {
        type            fixedValue;
	value		uniform 0;
    }
*/
    atmosphere
    {
        type		fixedValue;
        value		uniform 0;
       /* type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;*/
    }
/*    frontAndBack
    {
        type            empty;
    }
*/ 
}

// ************************************************************************* //
