tutorials/cfdemSolverMultiphase/particlesWaterEntry/CFD/0.org/vSmoothField
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      vSmoothField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    walls
    {
        type            zeroGradient;
    }

/*    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
*/ 
    atmosphere
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
