tutorials/cfdemSolverMultiphase/particlesWaterEntry/CFD/0.org/voidfraction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      voidfraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
/*    outlet
    {
        type            fixedValue;
        value           uniform 1;
    }
*/
    atmosphere
    {
        type            fixedValue;
        value           uniform 1;
    }
/*    frontAndBack
    {
        type            empty;
    }
*/ 

}


// ************************************************************************* //
