tutorials/cfdemSolverMultiphase/particlesWaterEntry/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.1;
maxAlphaCo	0.1;
/*
libs (
         "libOpenFOAM.so"
         "libsimpleSwakFunctionObjects.so" 
         "libswakFunctionObjects.so"
     );

functions
{
    volFlow
    {
        type                swakExpression;
        valueType           patch;
        patchName           atmosphere;
        
        verbose             true;
        expression          "U&Sf()";
        accumulations       ( sum );
	outputInterval	    500;
    }
}
*/
// ************************************************************************* //
